In [1]:
# Advanced Dataframes Exercises

In [76]:
import pandas as pd
import numpy as np
from pydataset import data

In [74]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [7]:
sql_test_read = pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

In [8]:
sql_test_read

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [10]:
type(sql_test_read)

pandas.core.frame.DataFrame

In [53]:
# Bonus Challenge: find all the databases that you can see. But get that data back as a dataframe. -Ryan

pd.read_sql('SHOW databases;', url)

# Since pd.read_sql == cool_magic, I can use the SQL queries I learned inside the pd data call. Beautiful!

              Database
0   information_schema
1            albums_db
2             chipotle
3          darden_1040
4               elo_db
5            employees
6            fruits_db
7              iris_db
8      join_example_db
9       mall_customers
10               mysql
11             numbers
12           quotes_db
13              sakila
14              svi_db
15         telco_churn
16          titanic_db
17     tsa_item_demand
18               world
19              zillow

### 1. Load the mpg dataset. Read the documentation for it, and use the data to answer these questions:

In [54]:
mpg = data('mpg')

In [58]:
data('mpg', show_doc = True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [221]:
mpg = mpg.rename(columns = {'cty': 'city'})
mpg = mpg.rename(columns = {'hwy': 'highway'})

In [222]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,avg_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5,True

In [121]:
# On average, which manufacturer has the best miles per gallon?
mpg.groupby('manufacturer').hwy.mean().sort_values(ascending = False).head(1)

# When I have more time, try using idxmax() and iloc/loc to return this.

manufacturer
honda    32.555556
Name: hwy, dtype: float64

In [130]:
# How many different manufacturers are there?

mpg[['manufacturer']].agg(['value_counts'])

           manufacturer
           value_counts
dodge                37
toyota               34
volkswagen           27
ford                 25
chevrolet            19
audi                 18
subaru               14
hyundai              14
nissan               13
honda                 9
jeep                  8
pontiac               5
land rover            4
mercury               4
lincoln               3

In [133]:
mpg.manufacturer.agg('unique').count()

AttributeError: 'numpy.ndarray' object has no attribute 'count'

In [134]:
mpg.groupby('manufacturer').nunique()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
manufacturer,,,,,,,,,,,
audi,1,3,5,2,3,5,2,7,9,1,2
chevrolet,1,4,10,2,3,3,3,10,12,4,3
dodge,1,4,11,2,3,6,2,9,10,2,3
ford,1,4,6,2,2,5,2,8,12,2,3
honda,1,1,3,2,1,4,1,6,5,3,1
hyundai,1,2,5,2,2,4,1,6,7,1,2
jeep,1,1,6,2,2,2,1,6,7,4,1
land rover,1,1,4,2,1,2,1,2,2,2,1
lincoln,1,1,1,2,1,2,1,2,3,2,1
mercury,1,1,3,2,2,3,1,2,2,1,1
nissan,1,3,7,2,3,6,2,7,9,2,3
pontiac,1,1,3,2,2,2,1,3,4,2,1
subaru,1,2,2,2,1,3,1,4,5,2,3
toyota,1,6,11,2,3,7,2,13,15,1,4
volkswagen,1,4,6,2,3,5,1,10,7,3,3

In [161]:
# This was the simplest method I found of counting unique values in the manufacturer column.
unique_man = mpg['manufacturer'].nunique()

print(f'There are {unique_man} unique manufacturers in the mpg dataset.')

There are 15 unique manufacturers in the mpg dataset.

In [154]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [163]:
# How many different models are there?

unique_models = mpg.model.nunique()

print(f'There are {unique_models} unique models of cars in the mpg dataset.')

There are 38 unique models of cars in the mpg dataset.

- Do automatic or manual cars have better miles per gallon?

In [225]:
# Do automatic or manual cars have better miles per gallon?

# First, need to create a column that is the avg of cty and hwy:

mpg['avg_mileage'] = (mpg.city + mpg.highway) / 2

In [226]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,avg_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5,True

In [227]:
my_mileage_cols = ['trans', 'avg_mileage', 'city', 'highway']
mpg[my_mileage_cols]

          trans  avg_mileage  city  highway
1      auto(l5)         23.5    18       29
2    manual(m5)         25.0    21       29
3    manual(m6)         25.5    20       31
4      auto(av)         25.5    21       30
5      auto(l5)         21.0    16       26
..          ...          ...   ...      ...
230    auto(s6)         23.5    19       28
231  manual(m6)         25.0    21       29
232    auto(l5)         21.0    16       26
233  manual(m5)         22.0    18       26
234    auto(s6)         21.5    17       26

[234 rows x 4 columns]

In [228]:
mileage_pvtbl = mpg.pivot_table(values = ['avg_mileage', 'highway', 'city'], index = 'trans')
mileage_pvtbl

            avg_mileage       city    highway
trans
auto(av)      23.900000  20.000000  27.800000
auto(l3)      24.000000  21.000000  27.000000
auto(l4)      18.951807  15.939759  21.963855
auto(l5)      17.717949  14.717949  20.717949
auto(l6)      16.833333  13.666667  20.000000
auto(s4)      22.166667  18.666667  25.666667
auto(s5)      21.333333  17.333333  25.333333
auto(s6)      21.281250  17.375000  25.187500
manual(m5)    22.775862  19.258621  26.293103
manual(m6)    20.552632  16.894737  24.210526

In [229]:
# Faith's solution was very simple to isolate all automatic transmissions. I like the simplicity of it.

mpg['is_automatic'] = mpg.trans.str.startswith('a')

# Then I created a new pivot table where the index is whether or not the avg_mileage is from an automatic transmission or a manual transmission:
new_pvttbl = mpg.pivot_table(values = ['avg_mileage', 'city', 'highway'], index = 'is_automatic')
new_pvttbl

              avg_mileage       city    highway
is_automatic
False           22.227273  18.675325  25.779221
True            19.130573  15.968153  22.292994

### 2. Joining and Merging

#### Copy the users and roles dataframes from the examples above. 
- What do you think a right join would look like? 
- An outer join? 
- What happens if you drop the foreign keys from the dataframes and try to merge them?

In [231]:
mpg.groupby('is_automatic')[['city', 'highway', 'avg_mileage']].mean().sort_values(by = 'highway', ascending = False)

                   city    highway  avg_mileage
is_automatic
False         18.675325  25.779221    22.227273
True          15.968153  22.292994    19.130573

In [77]:
mpg.groupby('manufacturer').hwy.max()

manufacturer
audi          31
chevrolet     30
dodge         24
ford          26
honda         36
hyundai       31
jeep          22
land rover    18
lincoln       18
mercury       19
nissan        32
pontiac       28
subaru        27
toyota        37
volkswagen    44
Name: hwy, dtype: int64

In [106]:
mpg.groupby('manufacturer').hwy.mean().sort_values(ascending = False).head(1)

manufacturer
honda    32.555556
Name: hwy, dtype: float64

In [109]:
mpg.groupby('manufacturer').hwy.mean().max()

32.55555555555556

In [89]:
mpg[['hwy']].agg("mean")

hwy    23.440171
dtype: float64

In [101]:
mpg[['manufacturer', 'class', 'year']].agg(['count', "mean"])

       manufacturer  class    year
count         234.0  234.0   234.0
mean            NaN    NaN  2003.5

In [91]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [78]:
mpg.groupby('manufacturer').describe()

# ok, that combination of methods is powerful.

             displ                                                       year  \
             count      mean           std  min    25%  50%    75%  max count
manufacturer
audi          18.0  2.544444  6.732032e-01  1.8  2.000  2.8  3.025  4.2  18.0
chevrolet     19.0  5.063158  1.370406e+00  2.4  4.450  5.3  5.850  7.0  19.0
dodge         37.0  4.378378  8.679910e-01  2.4  3.800  4.7  4.700  5.9  37.0
ford          25.0  4.536000  5.407402e-01  3.8  4.000  4.6  4.600  5.4  25.0
honda          9.0  1.711111  1.452966e-01  1.6  1.600  1.6  1.800  2.0   9.0
hyundai       14.0  2.428571  3.646464e-01  2.0  2.100  2.4  2.650  3.3  14.0
jeep           8.0  4.575000  1.015241e+00  3.0  3.925  4.7  4.950  6.1   8.0
land rover     4.0  4.300000  2.581989e-01  4.0  4.150  4.3  4.450  4.6   4.0
lincoln        3.0  5.400000  1.087792e-15  5.4  5.400  5.4  5.400  5.4   3.0
mercury        4.0  4.400000  4.898979e-01  4.0  4.000  4.3  4.700  5.0   4.0
nissan        13.0  3.269231  8.644696e-01  2.4  2.500  3.3  3.500  5.6  13.0
pontiac        5.0  3.960000  8.080842e-01  3.1  3.800  3.8  3.800  5.3   5.0
subaru        14.0  2.457143  1.089410e-01  2.2  2.500  2.5  2.500  2.5  14.0
toyota        34.0  2.952941  9.313513e-01  1.8  2.250  2.7  3.400  5.7  34.0
volkswagen    27.0  2.255556  4.431820e-01  1.8  2.000  2.0  2.500  3.6  27.0

                           ...    cty         hwy                             \
                     mean  ...    75%   max count       mean       std   min
manufacturer               ...
audi          2003.500000  ...  18.75  21.0  18.0  26.444444  2.175322  23.0
chevrolet     2004.684211  ...  16.50  22.0  19.0  21.894737  5.108759  14.0
dodge         2004.108108  ...  15.00  18.0  37.0  17.945946  3.574182  12.0
ford          2002.600000  ...  15.00  18.0  25.0  19.360000  3.327662  15.0
honda         2003.000000  ...  25.00  28.0   9.0  32.555556  2.554952  29.0
hyundai       2004.142857  ...  19.75  21.0  14.0  26.857143  2.178819  24.0
jeep          2005.750000  ...  15.00  17.0   8.0  17.625000  3.248626  12.0
land rover    2003.500000  ...  12.00  12.0   4.0  16.500000  1.732051  15.0
lincoln       2002.000000  ...  11.50  12.0   3.0  17.000000  1.000000  16.0
mercury       2003.500000  ...  13.25  14.0   4.0  18.000000  1.154701  17.0
nissan        2003.846154  ...  19.00  23.0  13.0  24.615385  5.091471  17.0
pontiac       2002.600000  ...  18.00  18.0   5.0  26.400000  1.140175  25.0
subaru        2004.142857  ...  20.00  21.0  14.0  25.571429  1.157868  23.0
toyota        2002.705882  ...  21.00  28.0  34.0  24.911765  6.166221  15.0
volkswagen    2002.666667  ...  21.00  35.0  27.0  29.222222  5.315676  23.0


                25%   50%    75%   max
manufacturer
audi          25.00  26.0  27.75  31.0
chevrolet     17.00  23.0  26.00  30.0
dodge         16.00  17.0  21.00  24.0
ford          17.00  18.0  22.00  26.0
honda         32.00  32.0  34.00  36.0
hyundai       26.00  26.5  28.00  31.0
jeep          16.25  18.5  19.25  22.0
land rover    15.00  16.5  18.00  18.0
lincoln       16.50  17.0  17.50  18.0
mercury       17.00  18.0  19.00  19.0
nissan        20.00  26.0  27.00  32.0
pontiac       26.00  26.0  27.00  28.0
subaru        25.00  26.0  26.00  27.0
toyota        20.00  26.0  29.75  37.0
volkswagen    26.00  29.0  29.00  44.0

[15 rows x 40 columns]

### 3. Getting data from SQL databases

##### Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url formatted like in the examples in this lesson.

In [42]:
# Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url formatted like in the examples in this lesson.

from env import host, user, password

get_db_url_var = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [43]:
# Use your function to obtain a connection to the employees database.

pd.read_sql('SELECT * FROM employees LIMIT 100', get_db_url_var)

    emp_no  birth_date   first_name    last_name gender   hire_date
0    10001  1953-09-02       Georgi      Facello      M  1986-06-26
1    10002  1964-06-02      Bezalel       Simmel      F  1985-11-21
2    10003  1959-12-03        Parto      Bamford      M  1986-08-28
3    10004  1954-05-01    Chirstian      Koblick      M  1986-12-01
4    10005  1955-01-21      Kyoichi     Maliniak      M  1989-09-12
..     ...         ...          ...          ...    ...         ...
95   10096  1954-09-16       Jayson      Mandell      M  1990-01-14
96   10097  1952-02-27        Remzi  Waschkowski      M  1990-09-15
97   10098  1961-09-23  Sreekrishna    Servieres      F  1985-05-13
98   10099  1956-05-25       Valter      Sullins      F  1988-10-18
99   10100  1953-04-21     Hironobu    Haraldson      F  1987-09-21

[100 rows x 6 columns]

In [26]:
# Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url formatted like in the examples in this lesson.


def get_db_url(host, user, password, database):
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

In [50]:
get_db_url('123.123.123.123', 'iamnomarch', 'thisisabadpassword', 'this_datebase')

'mysql+pymysql://iamnomarch:thisisabadpassword@123.123.123.123/this_datebase'

In [32]:
from env import host, user, password

In [47]:
logging_in = get_db_url(host, user, password, "employees")

In [48]:
pd.read_sql('SELECT * FROM employees LIMIT 100', logging_in)

    emp_no  birth_date   first_name    last_name gender   hire_date
0    10001  1953-09-02       Georgi      Facello      M  1986-06-26
1    10002  1964-06-02      Bezalel       Simmel      F  1985-11-21
2    10003  1959-12-03        Parto      Bamford      M  1986-08-28
3    10004  1954-05-01    Chirstian      Koblick      M  1986-12-01
4    10005  1955-01-21      Kyoichi     Maliniak      M  1989-09-12
..     ...         ...          ...          ...    ...         ...
95   10096  1954-09-16       Jayson      Mandell      M  1990-01-14
96   10097  1952-02-27        Remzi  Waschkowski      M  1990-09-15
97   10098  1961-09-23  Sreekrishna    Servieres      F  1985-05-13
98   10099  1956-05-25       Valter      Sullins      F  1988-10-18
99   10100  1953-04-21     Hironobu    Haraldson      F  1987-09-21

[100 rows x 6 columns]

In [152]:
# man_count_alt = mpg.agg('manufacturer').unique()

# print(f'Those manufacturers are: {man_count}')